glloq/Servo-Plucked-Strings-GMB/firmware/src/platform/esp32/ServoBank.cpp
#include "ServoBank.h"

#include <cstdio>

#include "../../core/configuration/FingerTarget.h"
#include "../../core/configuration/ServoStroke.h"

#if defined(ARDUINO)
#include <Wire.h>
#endif

namespace gmb {

namespace {
#if defined(ARDUINO)
constexpr uint32_t kServoFreqHz = 50;
// PCA9685 FULL OFF. An OFF count of 4096 is bit 12, which lands in LEDn_OFF_H[4]
// — the datasheet's dedicated "output always off" bit. It is NOT the same as an
// OFF count of 0: NXP warns against programming the ON and OFF counters to the
// same value, and (0, 0) does exactly that. Adafruit's setPin(num, 0) emits this
// same 4096 (audit P1).
constexpr uint16_t kPcaFullOff = 4096;
// The ESP32-S3 LEDC supports 1..14 bits; 14 bits @ 50 Hz keeps ~1 µs steps.
constexpr uint8_t kLedcResBits = 14;
uint32_t usToDuty(uint16_t us) {
    const uint32_t maxDuty = (1u << kLedcResBits) - 1;
    return static_cast<uint32_t>((static_cast<uint64_t>(us) * maxDuty) / 20000u);
}
#endif
uint16_t clampPulse(const ServoConfig& s, uint16_t us) {
    if (us < s.pulseMinUs) us = s.pulseMinUs;
    if (us > s.pulseMaxUs) us = s.pulseMaxUs;
    return us;
}
}  // namespace

void ServoBank::begin(const std::vector<ServoConfig>& servos, int8_t sda, int8_t scl,
                      int8_t oePin, int8_t sda2, int8_t scl2, int8_t oePin2) {
    servos_ = servos;
    rt_.assign(servos.size(), Rt{});
    ledcCh_.assign(servos.size(), -1);
    attached_.assign(servos.size(), false);
    oePin_ = oePin;
    oePin2_ = oePin2;
    directCount_ = 0;
    pcaUsed_ = false;
    directAttachFault_ = false;
    pcaAttachFault_ = false;
    for (int b = 0; b < 2; ++b)
        for (int i = 0; i < kMaxPca; ++i) pcaPresent_[b][i] = false;

    bool busUsed[2] = {false, false};
    for (const auto& s : servos_) {
        if (s.enabled && s.source == ServoSource::Pca && s.pcaBoard < kMaxPca) {
            int bus = s.i2cBus > 1 ? 1 : s.i2cBus;
            pcaPresent_[bus][s.pcaBoard] = true;
            pcaUsed_ = true;
            busUsed[bus] = true;
        }
    }

#if defined(ARDUINO)
    // /OE lines high (outputs disabled) for a safe boot, on both buses' safety pins.
    for (int8_t oe : {oePin_, oePin2_}) {
        if (oe >= 0) { pinMode(oe, OUTPUT); digitalWrite(oe, HIGH); }
    }
    // Bring up each I2C controller that actually carries a board (Wire = bus 0,
    // Wire1 = bus 1), then initialise every present board's driver on its own bus.
    if (busUsed[0] && sda >= 0 && scl >= 0) Wire.begin(sda, scl);
    if (busUsed[1] && sda2 >= 0 && scl2 >= 0) Wire1.begin(sda2, scl2);
    for (int b = 0; b < 2; ++b) {
        for (int i = 0; i < kMaxPca; ++i) {
            if (!pcaPresent_[b][i]) continue;
            // begin() returns false if the board does not ACK on its I2C bus.
            if (!pca_[b][i].begin()) pcaAttachFault_ = true;
            pca_[b][i].setPWMFreq(kServoFreqHz);
            // Cache what the driver actually programmed so every later write can
            // convert µs -> ticks locally (no readPrescale() round-trip per write)
            // and check setPWM()'s I2C result — see writePcaMicros().
            pcaPrescale_[b][i] = pca_[b][i].readPrescale();
            pcaOscHz_[b][i] = pca_[b][i].getOscillatorFrequency();
        }
    }
    // Attach direct-GPIO servos to LEDC channels (max 8 on the ESP32-S3).
    for (size_t i = 0; i < servos_.size(); ++i) {
        const ServoConfig& s = servos_[i];
        if (s.enabled && s.source == ServoSource::DirectGpio && s.gpio >= 0)
            attachDirect(static_cast<int>(i));
    }
#else
    (void)sda; (void)scl; (void)sda2; (void)scl2; (void)busUsed;
#endif
    hardStop();
}

bool ServoBank::attachDirect(int index) {
    if (index < 0 || index >= (int)servos_.size()) return false;
    const ServoConfig& s = servos_[index];
    if (s.source != ServoSource::DirectGpio || s.gpio < 0) return false;
    if (attached_[index]) return true;
#if defined(ARDUINO)
    // Reuse a previously-assigned channel, otherwise allocate a new one.
    int ch = ledcCh_[index];
    if (ch < 0) {
        if (directCount_ >= kMaxDirectServos) {
            directAttachFault_ = true;  // out of LEDC channels
            return false;
        }
        ch = directCount_++;
        ledcCh_[index] = static_cast<int8_t>(ch);
    }
#if ESP_ARDUINO_VERSION_MAJOR >= 3
    if (!ledcAttach(s.gpio, kServoFreqHz, kLedcResBits)) {
        directAttachFault_ = true;
        return false;
    }
#else
    ledcSetup(ch, kServoFreqHz, kLedcResBits);
    ledcAttachPin(s.gpio, ch);
#endif
    attached_[index] = true;
    return true;
#else
    attached_[index] = true;
    return true;
#endif
}

#if defined(ARDUINO)
// Write one pulse to a PCA9685 channel and REPORT WHETHER THE I2C TRANSACTION
// SUCCEEDED (audit P1).
//
// Adafruit_PWMServoDriver::writeMicroseconds() calls setPWM() and throws its
// return value away, so every write looked successful even with the board
// unplugged: the firmware believed a finger had been pressed and went on to
// pluck, producing a wrong note, an open string or silence. Only the periodic
// pcaHealthy() probe noticed — up to 500 ms later.
//
// setPWM() returns 0 on success (Wire.endTransmission() == 0) and non-zero on an
// I2C error, so this does the µs -> ticks conversion itself and checks it. Doing
// our own conversion also drops writeMicroseconds()' readPrescale() — an extra
// I2C READ on EVERY servo write, on a bus that carries the whole instrument.
ActuatorResult ServoBank::writePcaMicros(int bus, uint8_t board, uint8_t channel,
                                         uint16_t us) {
    // ticks = us / (1e6 * (prescale+1) / oscillator), i.e. the datasheet's §7.3.5
    // relation, with the prescale we programmed in begin() (cached, not re-read).
    uint32_t usPerTickNum = static_cast<uint32_t>(pcaPrescale_[bus][board]) + 1;
    if (usPerTickNum == 0 || pcaOscHz_[bus][board] == 0)
        return ActuatorResult::DriverUnavailable;  // never initialised
    // ticks = us * osc / (1e6 * (prescale+1)), 64-bit and rounded to NEAREST.
    // Adafruit truncates, which loses up to a full tick (~4.9 µs at 50 Hz, about
    // 0.45° of servo travel) always in the same direction; rounding halves the
    // worst case and centres it. A PCA9685 tick is the hard floor either way.
    const uint64_t den = 1000000ull * usPerTickNum;
    uint64_t ticks = (static_cast<uint64_t>(us) * pcaOscHz_[bus][board] + den / 2) / den;
    if (ticks > 4095) ticks = 4095;
    uint8_t err = pca_[bus][board].setPWM(channel, 0, static_cast<uint16_t>(ticks));
    if (err != 0) {
        // The board ACKed at boot but this transaction failed: treat it exactly
        // like a lost board so the caller faults the string instead of assuming
        // the actuator moved. The periodic probe confirms and isolates it.
        return ActuatorResult::BusFault;
    }
    return ActuatorResult::Ok;
}
#endif

ActuatorResult ServoBank::writeMicros(int index, uint16_t us) {
    if (index < 0 || index >= (int)servos_.size()) return ActuatorResult::InvalidIndex;
    const ServoConfig& s = servos_[index];
    if (!s.enabled) return ActuatorResult::Disabled;  // never drive a disabled servo
    const uint16_t logicalUs = clampPulse(s, us);  // pre-inversion, for sweep scaling
    // Apply inversion by mirroring within the calibrated pulse window.
    uint16_t outUs = s.inverted
        ? static_cast<uint16_t>(s.pulseMinUs + s.pulseMaxUs - logicalUs)
        : logicalUs;
#if defined(ARDUINO)
    if (s.source == ServoSource::Pca) {
        int bus = s.i2cBus > 1 ? 1 : s.i2cBus;
        // Board never initialised (absent at boot) — distinct from a mid-run I2C loss,
        // which the write result and pcaHealthy() surface separately.
        if (s.pcaBoard >= kMaxPca || !pcaPresent_[bus][s.pcaBoard])
            return ActuatorResult::DriverUnavailable;
        ActuatorResult r = writePcaMicros(bus, s.pcaBoard, s.channel, outUs);
        if (r != ActuatorResult::Ok) return r;  // nothing reached the servo
    } else if (s.gpio >= 0) {
        if (!attached_[index] && !attachDirect(index))
            return ActuatorResult::OutputFault;  // LEDC (re)attach failed
#if ESP_ARDUINO_VERSION_MAJOR >= 3
        // Arduino-ESP32 3.x returns bool: a refused write means the pulse never
        // reached the pin, and the software model must not move (audit P2 — this
        // guarantee held for the PCA path but not yet for direct GPIO).
        if (!ledcWrite(s.gpio, usToDuty(outUs))) return ActuatorResult::OutputFault;
#else
        if (ledcCh_[index] < 0) return ActuatorResult::OutputFault;
        ledcWrite(ledcCh_[index], usToDuty(outUs));
#endif
    } else {
        return ActuatorResult::OutputFault;  // no output pin configured
    }
    rt_[index].pwmOff = false;
#else
    (void)outUs;
    if (hostWriteResult) {
        ActuatorResult forced = hostWriteResult(index);
        if (forced != ActuatorResult::Ok) return forced;
    }
#endif
    // ONLY NOW is the software model allowed to move (audit P2): lastUs feeds
    // sweepMsToFret(), so recording a pulse the servo never received made the
    // next move's travel estimate wrong — the scheduler would wait for a sweep
    // that starts somewhere else entirely.
    rt_[index].lastUs = logicalUs;
    ++moveCount_;  // a servo pulse actually reached an output (diagnostics, P2.19)
    return ActuatorResult::Ok;
}

// Silence one output, and SAY whether it worked (audit P1).
//
// Two defects lived here. First the encoding: setPWM(ch, 0, 0) is NOT the
// PCA9685's full-off. The chip has a dedicated LEDn_OFF_H[4] "full OFF" bit, and
// NXP explicitly warns against programming the ON and OFF counters to the same
// value — which (0, 0) does. The full-off encoding is an OFF count of 4096, i.e.
// bit 12, which lands in LEDn_OFF_H[4]; that is what Adafruit's own setPin(num, 0)
// emits. Second, the result was discarded, so a channel that never went quiet
// still looked neutralised — and /OE was then released over it.
ActuatorResult ServoBank::writeOff(int index) {
    if (index < 0 || index >= (int)servos_.size()) return ActuatorResult::InvalidIndex;
    const ServoConfig& s = servos_[index];
#if defined(ARDUINO)
    if (s.source == ServoSource::Pca) {
        int bus = s.i2cBus > 1 ? 1 : s.i2cBus;
        if (s.pcaBoard >= kMaxPca || !pcaPresent_[bus][s.pcaBoard])
            return ActuatorResult::DriverUnavailable;
        // kPcaFullOff (4096) sets LEDn_OFF_H[4]: the output is held OFF whatever
        // the ON counter says. setPWM() returns the I2C status — checked now.
        if (pca_[bus][s.pcaBoard].setPWM(s.channel, 0, kPcaFullOff) != 0)
            return ActuatorResult::BusFault;
    } else if (s.gpio >= 0) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
        // Arduino-ESP32 3.x returns bool from both calls; a failure here means the
        // pin may still be driving a pulse, which is exactly what must not be
        // reported as "off" (audit P2).
        bool cleared = ledcWrite(s.gpio, 0);
        bool detached = ledcDetach(s.gpio);  // truly release the pin (no residual signal)
        attached_[index] = false;            // must reattach before the next write
        if (!cleared || !detached) return ActuatorResult::OutputFault;
#else
        if (ledcCh_[index] >= 0) ledcWrite(ledcCh_[index], 0);
        ledcDetachPin(s.gpio);
        attached_[index] = false;
#endif
    } else {
        return ActuatorResult::OutputFault;  // no output pin configured
    }
    rt_[index].pwmOff = true;
    return ActuatorResult::Ok;
#else
    (void)s;
    if (hostWriteResult) {
        ActuatorResult forced = hostWriteResult(index);
        if (forced != ActuatorResult::Ok) return forced;
    }
    rt_[index].pwmOff = true;
    return ActuatorResult::Ok;
#endif
}

ActuatorResult ServoBank::toRest(int index) {
    if (index < 0 || index >= (int)servos_.size()) return ActuatorResult::InvalidIndex;
    return writeMicros(index, servos_[index].restUs);
}

ActuatorResult ServoBank::toActive(int index) {
    if (index < 0 || index >= (int)servos_.size()) return ActuatorResult::InvalidIndex;
    return writeMicros(index, servos_[index].activeUs);
}

