glloq/Servo-Plucked-Strings-GMB/firmware/src/platform/esp32/ServoBank.cpp
ActuatorResult ServoBank::toMicros(int index, uint16_t us) { return writeMicros(index, us); }

// ---------------------------------------------------------------------------
// The motion API. Every one of these follows the same rule (audit P2):
//
//     THE SOFTWARE MODEL ONLY MOVES ONCE THE DRIVER HAS ACCEPTED THE COMMAND.
//
// mode / strokeParity / returnAtMs used to be updated whatever writeMicros()
// returned, so a refused write left the bank believing the finger was down (or
// the plectrum mid-strike): update() would then schedule a return for a stroke
// that never happened, and sweepMsToFret() would time the next move from a
// position the servo never reached. On failure the state is left exactly as it
// was and the caller faults the axis.
// ---------------------------------------------------------------------------

ActuatorResult ServoBank::press(int index) {
    if (index < 0 || index >= (int)servos_.size()) return ActuatorResult::InvalidIndex;
    ActuatorResult r = writeMicros(index, servos_[index].activeUs);
    if (r != ActuatorResult::Ok) return r;  // caller faults the axis; state untouched
    rt_[index].mode = Mode::Active;
    return r;
}

ActuatorResult ServoBank::pressFret(int index, int fret) {
    if (index < 0 || index >= (int)servos_.size()) return ActuatorResult::InvalidIndex;
    // A geared finger presses side B (activeBUs) for its second fret, side A
    // (activeUs) otherwise — identical to press() for a plain single finger.
    ActuatorResult r = writeMicros(index, fingerActiveUsForFret(servos_[index], fret));
    if (r != ActuatorResult::Ok) return r;
    rt_[index].mode = Mode::Active;
    return r;
}

ActuatorResult ServoBank::moveTo(int index, uint16_t us) {
    if (index < 0 || index >= (int)servos_.size()) return ActuatorResult::InvalidIndex;
    ActuatorResult r = writeMicros(index, us);  // clamped to the servo's pulse window
    if (r != ActuatorResult::Ok) return r;
    rt_[index].mode = Mode::Active;             // hold: no rest-time PWM cut during a test
    return r;
}

ActuatorResult ServoBank::mute(int index) {
    if (index < 0 || index >= (int)servos_.size()) return ActuatorResult::InvalidIndex;
    uint16_t m = servos_[index].muteUs;
    if (m == 0) return ActuatorResult::Disabled;  // no mute position calibrated
    ActuatorResult r = writeMicros(index, m);     // clamped to the pulse window
    if (r != ActuatorResult::Ok) return r;
    rt_[index].mode = Mode::Active;   // hold against the string; caller releases later
    return r;
}

ActuatorResult ServoBank::release(int index) {
    if (index < 0 || index >= (int)servos_.size()) return ActuatorResult::InvalidIndex;
    ActuatorResult r = writeMicros(index, servos_[index].restUs);
    // A REFUSED release is the dangerous one: the finger is still pressing. Saying
    // Rest here would have update() cut its PWM at settle time and the caller
    // believe the string was free.
    if (r != ActuatorResult::Ok) return r;
    rt_[index].mode = Mode::Rest;
    rt_[index].restAtMs = 0;
    return r;
}

ActuatorResult ServoBank::strike(int index, double intensity) {
    if (index < 0 || index >= (int)servos_.size()) return ActuatorResult::InvalidIndex;
    const ServoConfig& s = servos_[index];
    // Velocity shapes the strike depth; on an alternate stroke the up-stroke
    // endpoint is used. The maths lives in servoStrikeTargetUs (unit-tested).
    bool upStroke = s.alternateDirection && rt_[index].strokeParity;
    ActuatorResult r = writeMicros(index, servoStrikeTargetUs(s, intensity, upStroke));
    // No stroke happened: do NOT enter Striking (update() would schedule a return
    // for it) and do NOT consume the alternation parity — the next real stroke
    // must still go in the direction this one was meant to.
    if (r != ActuatorResult::Ok) return r;
    rt_[index].mode = Mode::Striking;
    rt_[index].returnAtMs = 0;
    // Flip the stroke direction for the next strike on this servo.
    if (s.alternateDirection) rt_[index].strokeParity = !rt_[index].strokeParity;
    return r;
}

void ServoBank::update(uint32_t nowMs) {
    for (size_t i = 0; i < servos_.size(); ++i) {
        const ServoConfig& s = servos_[i];
        Rt& r = rt_[i];
        switch (r.mode) {
            case Mode::Striking:
                // Engagement time comes from strikeDurationMs() — the SAME value the
                // playback scheduler waits on, so a lift can never retract while the
                // stroke is still engaged (audit: strokeMs vs travelMs divergence).
                if (r.returnAtMs == 0)
                    r.returnAtMs = nowMs + strikeDurationMs(static_cast<int>(i));
                if ((int32_t)(nowMs - r.returnAtMs) >= 0) {
                    ActuatorResult res = toRest(static_cast<int>(i));
                    // Leaving Striking is DELIBERATE even on failure: this is a
                    // scheduling state, and staying in it would re-issue toRest()
                    // on every single tick against an already-broken bus. The
                    // claim about where the servo physically is lives in lastUs,
                    // which writeMicros() leaves untouched when the write fails
                    // (audit P2), so the next sweep is still timed from the last
                    // pulse the servo really received.
                    r.mode = Mode::Rest;
                    r.restAtMs = nowMs + s.settleMs;
                    // The automatic return is a SCHEDULED write with no caller to
                    // check it: surface a failure to the owner instead of silently
                    // pretending the plectrum came home (audit 4 P1.5). State is
                    // finalised BEFORE the callback (which may abort/hard-stop).
                    if (!ok(res) && updateFault_) updateFault_(static_cast<int>(i), res);
                }
                break;
            case Mode::Rest:
                if (r.restAtMs == 0) r.restAtMs = nowMs + s.settleMs;
                if (s.disableAtRest && !r.pwmOff && (int32_t)(nowMs - r.restAtMs) >= 0)
                    writeOff(static_cast<int>(i));
                break;
            case Mode::Active:
                break;
        }
    }
}

void ServoBank::outputEnable(bool on) {
#if defined(ARDUINO)
    // Drive every configured /OE line together (both buses when the /OE is split).
    for (int8_t oe : {oePin_, oePin2_})
        if (oe >= 0) digitalWrite(oe, on ? LOW : HIGH);  // /OE active-low
#else
    (void)on;
#endif
}

bool ServoBank::pcaHealthy() const {
    uint8_t ignored;
    return pcaHealthy(ignored);
}

bool ServoBank::pcaHealthy(uint8_t& failedBoard) const {
#if defined(ARDUINO)
    if (!pcaUsed_) return true;
    for (int b = 0; b < 2; ++b) {
        TwoWire& w = (b == 0) ? Wire : Wire1;
        for (int i = 0; i < kMaxPca; ++i) {
            if (!pcaPresent_[b][i]) continue;
            // The PCA9685 base address is 0x40 + board index (per bus). A board that
            // has been unplugged / lost power no longer ACKs its address.
            w.beginTransmission(static_cast<uint8_t>(0x40 + i));
            if (w.endTransmission() != 0) {
                failedBoard = static_cast<uint8_t>(b * 8 + i);  // matches board()
                return false;
            }
        }
    }
    return true;
#else
    (void)failedBoard;
    return true;
#endif
}

bool ServoBank::stringUsesBoard(int stringIndex, uint8_t boardBucket) const {
    for (size_t i = 0; i < servos_.size(); ++i) {
        const ServoConfig& s = servos_[i];
        if (s.enabled && s.stringIndex == stringIndex &&
            board(static_cast<int>(i)) == boardBucket)
            return true;
    }
    return false;
}

std::string ServoBank::boardName(uint8_t boardBucket) {
    if (boardBucket == 0xFF) return "direct-GPIO";
    int bus = boardBucket / 8;
    int addr = 0x40 + (boardBucket % 8);
    char buf[24];
    std::snprintf(buf, sizeof(buf), "bus %d / 0x%02X", bus, addr);
    return std::string(buf);
}

