glloq/Servo-Plucked-Strings-GMB/firmware/src/platform/esp32/ServoBank.cpp
void ServoBank::hardStop() {
    // Immediate hard cut: PCA via /OE, direct servos by cutting their PWM now
    // (do not wait for settleMs), regardless of disableAtRest. Used for E-stop /
    // panic / major fault and as the final cut of a controlled park. Never gated on
    // a mechanical movement completing (spec P0 §21.2).
    //
    // Strict pass order (audit 7 P0): every NEUTRALISING action runs before any
    // I2C traffic. A hard stop is most needed precisely when hardware misbehaves,
    // and a wedged/slow I2C bus in the old per-servo loop could delay the
    // direct-GPIO cut behind dozens of blocking PCA transactions.
    outputEnable(false);  // pass 1: every PCA output dead at once (GPIO /OE line)
    for (int i = 0; i < (int)servos_.size(); ++i)  // pass 2: direct PWM off — no
        if (servos_[i].source == ServoSource::DirectGpio) writeOff(i);  // I2C yet
    // pass 3 (best effort, everything already neutralised): clear every PCA channel
    // to FULL OFF. The old behaviour preloaded REST here "so /OE re-lights at
    // rest" — but that meant the next outputEnable(true) released a live pulse on
    // EVERY channel simultaneously, an ungoverned all-servo start (audit P0). With
    // the channels off, arming re-enables /OE over silent outputs and then commands
    // REST progressively through the governed park.
    for (int i = 0; i < (int)servos_.size(); ++i)
        if (servos_[i].source != ServoSource::DirectGpio) writeOff(i);
    for (auto& r : rt_) r = Rt{};  // pass 4: runtime state cleared
    parkActive_ = false;           // a park in progress is cancelled with it
    parkQueue_.clear();
    parkNext_ = 0;
}

ServoBank::ParkResult ServoBank::neutralizePcaOutputs() {
    // FULL OFF on every enabled PCA channel, so driving /OE low can never release
    // stale latched pulses on all channels at once (audit P0). Cheap: one I2C
    // write per PCA servo.
    //
    // The result is now REPORTED (audit P1). This is the one place where ignoring
    // an I2C error was directly dangerous: a channel whose full-off never landed
    // keeps its previous pulse latched, and the caller was about to pull /OE low
    // over it — releasing a stale servo command at the exact moment the outputs
    // come alive. Every channel is still attempted (a caller that aborts wants to
    // have silenced as much as it could), but the FIRST failure is carried out.
    ParkResult r;
    for (int i = 0; i < (int)servos_.size(); ++i) {
        if (!servos_[i].enabled || servos_[i].source != ServoSource::Pca) continue;
        ActuatorResult w = writeOff(i);
        if (w != ActuatorResult::Ok && r.ok) {
            r.ok = false;
            r.failedServo = i;
            r.reason = w;
        }
    }
    return r;
}

uint32_t ServoBank::beginGovernedPark(uint32_t nowMs, uint8_t maxConcurrent,
                                      uint8_t maxPerBoard, uint16_t staggerMs) {
    parkGov_.configure(maxConcurrent, maxPerBoard, staggerMs);
    parkGov_.reset();
    parkQueue_.clear();
    parkNext_ = 0;
    parkResult_ = ParkResult{};
    parkDoneAtMs_ = nowMs;
    parkActive_ = true;
    std::vector<uint8_t> boards;
    for (int i = 0; i < (int)servos_.size(); ++i) {
        if (!servos_[i].enabled) continue;  // disabled: never driven, never parked
        parkQueue_.push_back(i);
        boards.push_back(board(i));
    }
    // Upper bound for the caller's parking timeout: the governor's own batch
    // forecast (exact simulation of the stagger schedule from clean windows) plus
    // the slowest servo's travel + settle. With staggerMs == 0 the forecast is 0
    // and this equals parkDurationMs() — the historical behaviour.
    return parkGov_.forecastBatchDelayMs(nowMs, boards.data(), boards.size()) +
           parkDurationMs();
}

ServoBank::ParkResult ServoBank::serviceGovernedPark(uint32_t nowMs) {
    if (!parkActive_) return parkResult_;
    while (parkNext_ < parkQueue_.size()) {
        int i = parkQueue_[parkNext_];
        // One start permit per servo, honouring the global + per-board caps and the
        // stagger window; a servo on no PCA board (direct GPIO, bucket 0xFF) is only
        // bounded by the global cap — the same rule the play-time governor applies.
        if (!parkGov_.requestStart(nowMs, board(i))) break;  // retry next tick
        ActuatorResult r = release(i);
        if (r != ActuatorResult::Ok && r != ActuatorResult::Disabled &&
            parkResult_.ok) {
            parkResult_.ok = false;
            parkResult_.failedServo = i;
            parkResult_.reason = r;
        }
        uint32_t settle = nowMs + servos_[i].travelMs + servos_[i].settleMs;
        if (static_cast<int32_t>(settle - parkDoneAtMs_) > 0) parkDoneAtMs_ = settle;
        ++parkNext_;
    }
    return parkResult_;
}

bool ServoBank::governedParkDone(uint32_t nowMs) const {
    return parkActive_ && parkNext_ >= parkQueue_.size() &&
           static_cast<int32_t>(nowMs - parkDoneAtMs_) >= 0;
}

ServoBank::ParkResult ServoBank::moveAllToRest() {
    // Controlled park phase 1: drive every servo to rest with outputs kept live. Each
    // release() writes the rest pulse and lets update()/disableAtRest cut idle PWM in
    // the normal way; the caller waits parkDurationMs() for the travel to finish.
    // The FIRST failed rest command is reported (audit 7 P1): a park whose write
    // never reached a servo must not let the caller assume the finger lifted —
    // arming / a profile swap has to abort instead of tearing the old config down.
    ParkResult out;
    for (int i = 0; i < (int)servos_.size(); ++i) {
        ActuatorResult r = release(i);
        // Disabled servos are not part of the mechanical park (never driven).
        if (r == ActuatorResult::Ok || r == ActuatorResult::Disabled) continue;
        if (out.ok) { out.ok = false; out.failedServo = i; out.reason = r; }
    }
    return out;
}

uint32_t ServoBank::parkDurationMs() const {
    uint32_t w = 0;
    for (const auto& s : servos_) {
        if (!s.enabled) continue;
        uint32_t t = static_cast<uint32_t>(s.travelMs) + s.settleMs;
        if (t > w) w = t;
    }
    return w;
}

int ServoBank::servoIndex(const std::string& function, int stringIndex) const {
    for (size_t i = 0; i < servos_.size(); ++i) {
        if (servos_[i].enabled && servos_[i].function == function &&
            servos_[i].stringIndex == stringIndex)
            return static_cast<int>(i);
    }
    return -1;
}

int ServoBank::fingerIndexForFret(int stringIndex, int fret) const {
    if (fret <= 0) return -1;  // open string: no finger
    for (size_t i = 0; i < servos_.size(); ++i) {
        const ServoConfig& s = servos_[i];
        // Matches a plain finger on `fret` OR a geared finger whose side A or side B
        // frets `fret` (fingerServesFret checks both).
        if (s.enabled && s.stringIndex == stringIndex && fingerServesFret(s, fret))
            return static_cast<int>(i);
    }
    return -1;
}

uint16_t ServoBank::sweepMsToFret(int index, int fret) const {
    if (index < 0 || index >= (int)servos_.size()) return 0;
    uint16_t toUs = fingerActiveUsForFret(servos_[index], fret);
    return fingerSweepMs(servos_[index], rt_[index].lastUs, toUs);
}

}  // namespace gmb
